*Using Pandas*

In [ ]:
from google.colab import drive
drive.mount('/content/drive')
import os
os.chdir("/content/drive/My Drive/Colab Notebooks")

Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np
dataset = pd.read_csv('Social_Network_Ads.csv')
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [ ]:
dataset['NewGender'] = pd.factorize(dataset.Gender)[0]

In [ ]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  NewGender
0  15624510    Male   19            19000          0          0
1  15810944    Male   35            20000          0          0
2  15668575  Female   26            43000          0          1
3  15603246  Female   27            57000          0          1
4  15804002    Male   19            76000          0          0

In [ ]:
dataset.Gender.value_counts()

Female    204
Male      196
Name: Gender, dtype: int64

In [ ]:
dataset.NewGender.value_counts()

1    204
0    196
Name: NewGender, dtype: int64

**Using sklearn**

In [ ]:
from sklearn.preprocessing import  LabelEncoder
le = LabelEncoder()
dataset['New2Gender'] = le.fit_transform(dataset.Gender)
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  NewGender  New2Gender
0  15624510    Male   19            19000          0          0           1
1  15810944    Male   35            20000          0          0           1
2  15668575  Female   26            43000          0          1           0
3  15603246  Female   27            57000          0          1           0
4  15804002    Male   19            76000          0          0           1